# Series

In [1]:
import numpy as np
import pandas as pd

In [2]:
pd1 = pd.Series([2,3,4,5])
pd1

0    2
1    3
2    4
3    5
dtype: int64

In [3]:
pd1.values

array([2, 3, 4, 5], dtype=int64)

In [4]:
pd1.index

RangeIndex(start=0, stop=4, step=1)

In [5]:
pd1.name = 'fruits'
pd1

0    2
1    3
2    4
3    5
Name: fruits, dtype: int64

In [6]:
pd1.dtype

dtype('int64')

In [7]:
type(pd1.values)

numpy.ndarray

In [8]:
pd1[1]

3

In [9]:
pd1.index = ['apple','mango','banana','orange']
pd1

apple     2
mango     3
banana    4
orange    5
Name: fruits, dtype: int64

In [10]:
pd.Series({
    'apple':2,
    'mangp':3,
    'banana':4
},name = 'fruits')

apple     2
mangp     3
banana    4
Name: fruits, dtype: int64

In [11]:
pd.Series(
[2,3,4],
index = ['apple','mango','orange'],
name = 'fruits')

apple     2
mango     3
orange    4
Name: fruits, dtype: int64

In [12]:
pd.Series(pd1,['apple','orange'])

apple     2
orange    5
Name: fruits, dtype: int64

In [13]:
pd.Series(pd1,index = ['apple','orange'])

apple     2
orange    5
Name: fruits, dtype: int64

In [14]:
pd1['mango']

3

In [15]:
pd1.iloc[0]

2

In [16]:
pd1.iloc[-1]

5

In [17]:
pd1.iloc[[0,1,3]]

apple     2
mango     3
orange    5
Name: fruits, dtype: int64

In [18]:
pd1['apple':'orange']
# orange included

apple     2
mango     3
banana    4
orange    5
Name: fruits, dtype: int64

In [19]:
pd1>3

apple     False
mango     False
banana     True
orange     True
Name: fruits, dtype: bool

In [20]:
pd1[pd1>4]

orange    5
Name: fruits, dtype: int64

In [21]:
pd1*2

apple      4
mango      6
banana     8
orange    10
Name: fruits, dtype: int64

In [22]:
pd1.mean()

3.5

In [23]:
pd1[pd1>pd1.mean()]

banana    4
orange    5
Name: fruits, dtype: int64

In [24]:
pd1.std()

1.2909944487358056

In [25]:
np.log(pd1)

apple     0.693147
mango     1.098612
banana    1.386294
orange    1.609438
Name: fruits, dtype: float64

In [26]:
pd1['mango':'orange'].mean()

4.0

In [27]:
pd1['orange']=6
pd1

apple     2
mango     3
banana    4
orange    6
Name: fruits, dtype: int64

In [28]:
pd1[pd1<3]=8
pd1

apple     8
mango     3
banana    4
orange    6
Name: fruits, dtype: int64

In [29]:
pd1.iloc[0] = 2
pd1

apple     2
mango     3
banana    4
orange    6
Name: fruits, dtype: int64

# DataFrames

In [30]:
df = pd.DataFrame( {
    'fruits': ['apple','mango','banana','orange'],
    'quantity': [2,3,4,5],
    'price': [20,30,10,15]
},columns = ['fruits','quantity','price'] )
df

   fruits  quantity  price
0   apple         2     20
1   mango         3     30
2  banana         4     10
3  orange         5     15

In [32]:
df.index = [1,2,3,4]
df

   fruits  quantity  price
1   apple         2     20
2   mango         3     30
3  banana         4     10
4  orange         5     15

In [33]:
df.columns

Index(['fruits', 'quantity', 'price'], dtype='object')

In [34]:
df.index

Int64Index([1, 2, 3, 4], dtype='int64')

In [36]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 4 entries, 1 to 4
Data columns (total 3 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   fruits    4 non-null      object
 1   quantity  4 non-null      int64
 2   price     4 non-null      int64
dtypes: int64(2), object(1)
memory usage: 128.0+ bytes

In [37]:
df.size

12

In [38]:
df.shape

(4, 3)

In [39]:
df.describe()

       quantity      price
count  4.000000   4.000000
mean   3.500000  18.750000
std    1.290994   8.539126
min    2.000000  10.000000
25%    2.750000  13.750000
50%    3.500000  17.500000
75%    4.250000  22.500000
max    5.000000  30.000000

In [41]:
df.dtypes.value_counts()

int64     2
object    1
dtype: int64

In [44]:
df.loc[1]

fruits      apple
quantity        2
price          20
Name: 1, dtype: object

In [46]:
df.iloc[-1]

fruits      orange
quantity         5
price           15
Name: 4, dtype: object

In [45]:
df['price']

1    20
2    30
3    10
4    15
Name: price, dtype: int64

In [47]:
df['fruits'].to_frame()

   fruits
1   apple
2   mango
3  banana
4  orange

In [48]:
df[['quantity','price']]

   quantity  price
1         2     20
2         3     30
3         4     10
4         5     15

In [49]:
df[1:3]

   fruits  quantity  price
2   mango         3     30
3  banana         4     10

In [51]:
df.loc[2:4]

   fruits  quantity  price
2   mango         3     30
3  banana         4     10
4  orange         5     15

In [52]:
df.loc[1:3,'price']

1    20
2    30
3    10
Name: price, dtype: int64

In [53]:
df.loc[1:3,['price','fruits']]

   price  fruits
1     20   apple
2     30   mango
3     10  banana

In [54]:
df.iloc[0]

fruits      apple
quantity        2
price          20
Name: 1, dtype: object

In [56]:
df.iloc[[0,1,-1]]

   fruits  quantity  price
1   apple         2     20
2   mango         3     30
4  orange         5     15

In [59]:
df.iloc[1:3,1]

2    3
3    4
Name: quantity, dtype: int64

In [60]:
df.iloc[2:4,[0,2]]

   fruits  price
3  banana     10
4  orange     15

In [61]:
df.iloc[1:3,1:3]

   quantity  price
2         3     30
3         4     10

In [64]:
df['fruits']=='mango'

1    False
2     True
3    False
4    False
Name: fruits, dtype: bool

In [65]:
df.loc[df['price']>20]

  fruits  quantity  price
2  mango         3     30

In [68]:
df.loc[df['price']>10,['price','fruits']]

   price  fruits
1     20   apple
2     30   mango
4     15  orange